app/controllers/emails_controller.rb

SELECT * FROM `emails` WHERE (emails.user_id = 1) ORDER BY emails.created_at DESC
---
  def index
    @search =  Email.search(params[:search])

INSERT INTO `emails` (`updated_at`, `body`, `subject`, `group_id`, `user_id`, `created_at`) VALUES('2009-11-20 11:52:44', 'rggr', 'try', 1, 2, '2009-11-20 11:52:44')
SELECT * FROM `students` WHERE (`students`.`id` = 3)
INSERT INTO `email_students` (`email_id`, `updated_at`, `student_id`, `created_at`) VALUES(2, '2009-11-20 11:52:45', 3, '2009-11-20 11:52:45')
---
  def create
       if params[:students].blank?
          flash.now[:error] = "Please select at least one student"
          render :action => "new"
       return nil
    end
     @email = current_user.emails.new(params[:email])
    respond_to do |format|
     if  @email.save
      	  body = params[:email][:body]
          params[:students].each do  |student_id|
            student = Student.find(student_id)
            body.gsub!(/@student/, student.name)
       	    body.gsub!(/@parent/, student.contact_name)
       	    body.gsub!(/@address/, student.address)
       	    body.gsub!(/@Student/, student.name)
       	    body.gsub!(/@Parent/, student.contact_name)
       	    body.gsub!(/@Address/, student.address)
            EmailStudent.create(:email_id => @email.id,:student_id => student_id)

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `groups` WHERE (`groups`.`id` = 2)
SELECT * FROM `students` INNER JOIN `groups_students` ON `students`.id = `groups_students`.student_id WHERE (`groups_students`.group_id = 2 )
---
   def group_students
    admin = current_user.has_role?('admin') ? current_user : User.find(current_user.parent_id)
    school = School.find(:first,:conditions=>['administrator_id=?',admin.id])
    academic_year = AcademicYear.current_academic_year_school(school.id)
    @students = Group.find(params[:group_id]).students.find(:all, :order => 'students.name ASC',:include =>[:student_classes],:conditions =>['status =? and student_classes.academic_year_id = ?','Active',academic_year.id]) rescue ''