app/controllers/groups_controller.rb

	def show
	   admin = current_user.has_role?('admin') ? current_user : User.find(current_user.parent_id)
     @group = admin.groups.find(params[:id])
     @students = @group.students.find(:all)
---
SELECT * FROM `students` INNER JOIN `groups_students` ON `students`.id = `groups_students`.student_id WHERE (`groups_students`.group_id = 2 )