app/controllers/groups_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `groups` WHERE (groups.user_id = 2) ORDER BY groups.status DESC
---
 	def index
    admin = current_user.has_role?('admin') ? current_user : User.find(current_user.parent_id)
    @search =  Group.search(params[:search])

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `groups` WHERE (`groups`.`id` = 2 AND (`groups`.user_id = 1))
---
	def show
	   admin = current_user.has_role?('admin') ? current_user : User.find(current_user.parent_id)
     @group = admin.groups.find(params[:id])

SELECT * FROM `students` WHERE (`students`.user_id = 1 AND (id not IN (9)))
---
	def edit
    @group,@group_students,@non_group_students = Group.find_group_all_students(params[:id],current_user)

SELECT * FROM `groups` WHERE (`groups`.user_id = 1 AND (status = 'Active'))
INSERT INTO `groups` (`name`, `status`, `updated_at`, `user_id`, `created_at`) VALUES('5th 2009', 'Active', '2009-11-27 04:42:12', 2, '2009-11-27 04:42:12')
SELECT * FROM `students` WHERE (`students`.user_id = 1)
SELECT * FROM `students` WHERE (`students`.`id` = 2)
---
	def create
    @group = current_user.groups.new(params[:group])
    students = params[:students]
    respond_to do |format|
      if @group.save
      	unless students.blank?
          students.each do  |student|
          @group.students << Student.find(student)

SELECT * FROM `groups` WHERE (`groups`.`id` = 2 AND (`groups`.user_id = 1))
SELECT * FROM `students` INNER JOIN `groups_students` ON `students`.id = `groups_students`.student_id WHERE (`groups_students`.group_id = 2 )
SELECT * FROM `students` WHERE (`students`.`id` = 9)
---
	def update
  	@group = current_user.groups.find(params[:id])
    students = params[:students]
    @group.students.clear
    respond_to do |format|
      if @group.update_attributes(params[:group])
      	unless students.nil?
        	students.each do  |student|
        		@group.students << Student.find(student)