app/controllers/letters_controller.rb

SELECT * FROM `letters` WHERE (letters.user_id = 1) ORDER BY letters.created_at DESC
---
   def index
  	@search =  Letter.search(params[:search])

SELECT * FROM `letters` WHERE (`letters`.`id` = 8 AND (`letters`.user_id = 2))
SELECT `students`.* FROM `students` INNER JOIN `letter_students` ON `students`.id = `letter_students`.student_id WHERE ((`letter_students`.letter_id = 8))
---
	def show
    @letter = Letter.find(params[:id])
    @students = @letter.students.find(:all)

SELECT * FROM `letters` WHERE (`letters`.`id` = 9 AND (`letters`.user_id = 2))
SELECT `students`.* FROM `students` INNER JOIN `letter_students` ON `students`.id = `letter_students`.student_id WHERE ((`letter_students`.letter_id = 9))
---
 def print
    @letter = Letter.find(params[:id])
    @students = @letter.students.find(:all)

INSERT INTO `letters` (`updated_at`, `group_id`, `content`, `user_id`, `created_at`) VALUES('2009-11-27 12:29:01', 3, 'hdghghghg\r\nikioioiooooooooooooooooooooooooooo \r\ntfyuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu \r\nyuyuyuuuuuuuuuuuuuuuuuuuuuuuuuuuuuu \r\nyuuuuuuuuuuuuuuuuuuuuuuuuuuu', 2, '2009-11-27 12:29:01')
INSERT INTO `letter_students` (`updated_at`, `student_id`, `letter_id`, `created_at`) VALUES('2009-11-27 12:29:01', 2, 9, '2009-11-27 12:29:01')
---
  def create
     if params[:students].blank?
      flash.now[:error] = "Please select at least one student"
      render :action => "new"
      return nil
    end
     @letter = current_user.letters.new(params[:letter])
    respond_to do |format|
      if @letter.save
           params[:students].each do|student_id|
           LetterStudent.create(:letter_id => @letter.id,:student_id => student_id)

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `groups` WHERE (`groups`.`id` = 2)
SELECT * FROM `students` INNER JOIN `groups_students` ON `students`.id = `groups_students`.student_id WHERE (`groups_students`.group_id = 2 )
---
   def group_students
      admin = current_user.has_role?('admin') ? current_user : User.find(current_user.parent_id)
    school = School.find(:first,:conditions=>['administrator_id=?',admin.id])
    academic_year = AcademicYear.current_academic_year_school(school.id)
    @students = Group.find(params[:group_id]).students.find(:all, :order => 'students.name ASC',:include =>[:student_classes],:conditions =>['status =? and student_classes.academic_year_id = ?','Active',academic_year.id]) rescue ''