app/controllers/message_templates_controller.rb

 	def index
  	@search = MessageTemplate.search(params[:search])
---
SELECT * FROM `message_templates` WHERE (message_templates.user_id = 1) ORDER BY message_templates.created_at DESC

  def show
    @message_template = current_user.message_templates.find(params[:id])
---
SELECT * FROM `message_templates` WHERE (`message_templates`.`id` = 1 AND (`message_templates`.user_id = 2))