app/controllers/message_services_controller.rb

	def new
   @message = Message.new
   @groups = current_user.groups.find(:all,:conditions =>['status =?','Active'])
---
SELECT * FROM `groups` WHERE (`groups`.user_id = 2 AND (status = 'Active'))

	def index
     @search =  Message.search(params[:search])
---
SELECT * FROM `messages` WHERE (messages.user_id = 1) ORDER BY messages.created_at DESC

	def show
    @message = current_user.messages.find(params[:id])
    @students = @message.students.find(:all)
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 92 AND (`messages`.user_id = 1))
SELECT `students`.* FROM `students` INNER JOIN `message_students` ON `students`.id = `message_students`.student_id WHERE ((`message_students`.message_id = 92))

 def create
	 begin
	   no_of_sms = params[:students].nil? ? 1 : params[:students].size
	   balance = current_user.balance.to_i - no_of_sms
	   MessageService.user = current_user.server_user_name
     MessageService.password = current_user.server_password
     MessageSchedule.user = current_user.server_user_name
     MessageSchedule.password = current_user.server_password
	   if balance >= 0
	     if params[:sms][:scheduled_date].blank?
	        @message = current_user.messages.new(params[:sms])
	     else
	        #sending on schedule
	        params[:sms][:scheduled_time] =  Time.parse(params[:schedule][:"scheduled_time(5i)"])
          @message = current_user.schedules.new(params[:sms])
       end

	     if @message.save
	       if !params[:students].nil?
	         message = @message.message_body
           params[:students].each do  |student_id|
             student_record = Student.find(student_id)
             student, parent = student_record.name, student_record.parent
             message.gsub!(/@student/, student)
       	     message.gsub!(/@parent/, parent)
       	     if  params[:sms][:scheduled_date].blank?
       	       sms = MessageService.create(:sms => params[:sms].merge!({:number => student_record.number}))
               message_student = MessageStudent.create(:message_id => @message.id,:student_id => student_id,:sms_id => sms.id)
             elsif  !params[:sms][:scheduled_date].blank?
               sms = MessageSchedule.create(:sms => params[:sms].merge!({:number => student_record.number}))
               schedule_student = ScheduleStudent.create(:schedule_id => @message.id,:student_id => student_id,:sms_id => sms.id)
             end
             current_user.update_attribute('balance', current_user.balance.to_i - 1)
---
INSERT INTO `messages` (`status`, `updated_at`, `number`, `message_body`, `group_id`, `sms_id`, `user_id`, `created_at`) VALUES(NULL, '2009-11-20 04:49:33', '9880814948', 'erere', NULL, NULL, 2, '2009-11-20 04:49:33')
INSERT INTO `schedules` (`status`, `updated_at`, `scheduled_time`, `number`, `scheduled_date`, `message_body`, `group_id`, `sms_id`, `user_id`, `created_at`) VALUES(NULL, '2009-11-20 04:55:44', '2009-11-20 21:00:00', '9880814948', '2009-11-12', 'gtry', NULL, NULL, 2, '2009-11-20 04:55:44')
SELECT * FROM `students` WHERE (`students`.`id` = 3)
INSERT INTO `schedule_students` (`status`, `updated_at`, `student_id`, `sms_id`, `schedule_id`, `created_at`) VALUES(NULL, '2009-11-20 05:04:30', 3, 66, 19, '2009-11-20 05:04:30')
UPDATE `users` SET `balance` = 50, `updated_at` = '2009-11-20 04:49:35' WHERE `id` = 2

	       else
	          if  params[:sms][:scheduled_date].blank?
       	  	  sms = MessageService.create(:sms => params[:sms])
       	      @message.update_attributes({:status => "Sent", :sms_id => sms.id})
       	    elsif  !params[:sms][:scheduled_date].blank?
       	   	   sms = MessageSchedule.create(:sms => params[:sms])
       	       @message.update_attributes({:status => "Scheduled", :sms_id => sms.id})
---
UPDATE `messages` SET `sms_id` = 388, `status` = 'Sent', `updated_at` = '2009-11-20 04:49:35' WHERE `id` = 106
UPDATE `schedules` SET `sms_id` = 0, `status` = 'Schedule', `updated_at` = '2009-11-20 04:56:35' WHERE `id` = 14

	def status_update
  	@message = Message.find(params[:id])
  	messages = @message.message_students
    MessageService.user = current_user.server_user_name
    MessageService.password = current_user.server_password
    unless messages.blank?
---
SELECT * FROM `messages` WHERE (`messages`.`id` = 107)
SELECT * FROM `message_students` WHERE (`message_students`.message_id = 107)

	def render_message_template
    @message_template = MessageTemplate.find(params[:sms_id]).message_body rescue ''
---
SELECT * FROM `message_templates` WHERE (`message_templates`.`id` = 1)

  def student_groups
      @students = Group.find(params[:group_id]).students rescue ''
---
SELECT * FROM `groups` WHERE (`groups`.`id` = 1)
SELECT * FROM `students` INNER JOIN `groups_students` ON `students`.id = `groups_students`.student_id WHERE (`groups_students`.group_id = 1 )