app/controllers/schedules_controller.rb

SELECT * FROM `schedules` WHERE (schedules.user_id = 2) ORDER BY schedules.created_at DESC
---
	def index
  	@search =  Schedule.search(params[:search])

SELECT * FROM `schedules` WHERE (`schedules`.`id` = 21 AND (`schedules`.user_id = 2))
SELECT `students`.* FROM `students` INNER JOIN `schedule_students` ON `students`.id = `schedule_students`.student_id WHERE ((`schedule_students`.schedule_id = 21))
---
 def show
    @schedule = Schedule.find(params[:id])
    @students = @schedule.students.find(:all)

SELECT * FROM `schedules` WHERE (`schedules`.`id` = 21)
SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
SELECT * FROM `schedule_students` WHERE (`schedule_students`.schedule_id = 21)
---
   def status_update
        @schedule = Schedule.find(params[:id])
       	schedules = @schedule.schedule_students
        admin = current_user.has_role?('admin') ? current_user : User.find(current_user.parent_id)
       	MessageSchedule.user = admin.server_user_name
        MessageSchedule.password = admin.server_password
       	unless schedules.blank?