app/controllers/students_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `students` WHERE (students.user_id = 1) ORDER BY students.created_at DESC
SELECT * FROM `groups` WHERE (`groups`.user_id = 1 AND (status ='Active'))
SELECT * FROM `roles` INNER JOIN `roles_users` ON `roles`.id = `roles_users`.role_id WHERE (`roles_users`.user_id = 1 )
---
  def index
    admin = current_user.has_role?('admin') ? current_user : User.find(current_user.parent_id)
    @search = Student.search(params[:search])
    @search.user_id = admin.id
    @search.status = "Active"  if !params[:search]
    @search.order ||= "descend_by_created_at"
    #if params[:role] == "teacher"
    @students = Student.find(:all,:include => {:groups => 'school' }, :conditions =>['schools.id = ?', current_user.school_id]).paginate :page => params[:page], :per_page => 25

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
SELECT * FROM `students` WHERE (`students`.`id` = 3 AND (`students`.user_id = 2))
---
  def show
    admin = current_user.has_role?('admin') ? current_user : User.find(current_user.parent_id)
    @student = admin.students.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `groups` WHERE (`groups`.user_id = 1 AND (status ='Active'))
---
  def create
    @student = Student.new(params[:student])
    @student.user_id = current_user.id
    respond_to do |format|
    #@username = params[:username]
   # @password = params[:pass]
    @student_name = @student.name
   # unless @username and @password.blank?
     if @student.save
      school = School.find(:first,:conditions=>['administrator_id=?',current_user.id])
     # user_object = User.create_row(params[:username],params[:pass],@student,current_user,school.id)
      academic_year = AcademicYear.current_academic_year_school(school.id)
      unless params[:groups].nil?
        params[:groups].each do|group|