app/controllers/users_controller.rb

SELECT * FROM `users` ORDER BY users.updated_at DESC
---
  	def index
      @search = User.search(params[:search])

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
---
   def edit
     if current_user.has_role?('super_admin') || current_user.has_role?('admin')
      @user = User.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '2') LIMIT 1
UPDATE `users` SET `server_user_name` = '', `updated_at` = '2009-11-27 04:18:38', `server_password` = '' WHERE `id` = 1
---
  def update
    if current_user.has_role?('super_admin')|| current_user.has_role?('admin')
     @user = User.find(params[:id])
    else
      @user = User.find(current_user.id)
    end
    if @user.update_attributes(params[:user])